--------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\jpbeal\Box\Econ 388\econ388_tech_growth\stata_code\data_cleaning
> .log
  log type:  text
 opened on:  11 Apr 2025, 15:05:02

. 
. * Set directory to data
. cd "C:\Users\jpbeal\Box\Econ 388\econ388_tech_growth\raw_data"
C:\Users\jpbeal\Box\Econ 388\econ388_tech_growth\raw_data

. 
. * Load the GDP data
. use pwt1001, clear

. 
. * Fix the names of places so we can merge
. replace country = "Bolivia" if country == "Bolivia (Plurinational State of)"
(70 real changes made)

. replace country = "Bosnia-Herzegovina" if country == "Bosnia and Herzegovina"
(70 real changes made)

. replace country = "Democratic Republic of the Congo" if country == "D.R. of the Cong
> o"
(70 real changes made)

. replace country = "Hong Kong" if country == "China, Hong Kong SAR"
(70 real changes made)

. replace country = "Iran" if country == "Iran (Islamic Republic of)"
(70 real changes made)

. replace country = "Laos" if country == "Lao People's DR"
(70 real changes made)

. replace country = "South Korea" if country == "Republic of Korea"
(70 real changes made)

. replace country = "Russia" if country == "Russian Federation"
(70 real changes made)

. replace country = "Slovak Republic" if country == "Slovakia"
(70 real changes made)

. replace country = "Syria" if country == "Syrian Arab Republic"
(70 real changes made)

. replace country = "Venezuala" if country == "Venezuela (Bolivarian Republic of)"
(70 real changes made)

. replace country = "Vietnam" if country == "Viet Nam"
(70 real changes made)

. 
. rename country country_name

. 
. * Merge in with the technological growth data
. merge 1:1 country_name year using chat.dta.tga

    Result                      Number of obs
    -----------------------------------------
    Not matched                        37,753
        from master                     4,432  (_merge==1)
        from using                     33,321  (_merge==2)

    Matched                             8,378  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(37,753 observations deleted)

. drop _merge

. 
. * Generate GDP per capita
. gen gdp_per_cap = rgdpna / pop
(1,642 missing values generated)

. 
. * Generate binary for developed
. gen developed = 0

. replace developed = 1 if country_name == "France" | country_name == "Germany" | coun
> try_name == "Italy" | country_name == "Japan" | country_name == "United Kingdom" | c
> ountry_name == "United States"
(354 real changes made)

. 
. * Variable lists for technology and controls
. local tech cellphone ag_tractor bed_hosp vehicle_car eft

. local controls avh hc pop pctivliteracy

. 
. * Generate log variables and store in log lists
. gen log_gdp_per_cap = log(gdp_per_cap)
(1,642 missing values generated)

. 
. local log_tech

. foreach var in `tech' {
  2.         gen log_`var' = log(`var')
  3.         local log_tech `log_tech' log_`var'
  4. }
(6,784 missing values generated)
(3,322 missing values generated)
(6,965 missing values generated)
(3,524 missing values generated)
(8,037 missing values generated)

. 
. local log_controls

. foreach var in `controls' {
  2.         gen log_`var' = log(`var')
  3.         local log_controls `log_controls' log_`var'
  4. }
(5,707 missing values generated)
(2,110 missing values generated)
(1,642 missing values generated)
(4,888 missing values generated)

. 
. * Collapse according to developed and undeveloped
. collapse (mean) log_gdp_per_cap `log_tech' `log_controls' `controls' [aweight=pop], 
> by(developed year)

. 
. * Computes percent changes and store in growth lists
. tsset developed year

Panel variable: developed (strongly balanced)
 Time variable: year, 1950 to 2008
         Delta: 1 unit

. bysort developed (year): gen g_gdp_per_cap = D.log_gdp_per_cap
(2 missing values generated)

. 
. local g_tech

. foreach var in `tech' {
  2.         bysort developed (year): gen g_`var' = D.log_`var'
  3.         local g_tech `g_tech' g_`var'
  4. }
(75 missing values generated)
(38 missing values generated)
(71 missing values generated)
(13 missing values generated)
(88 missing values generated)

. 
. local g_controls

. foreach var in `controls' {
  2.         bysort developed (year): gen g_`var' = D.log_`var'
  3.         local g_controls `g_controls' g_`var'
  4. }
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(48 missing values generated)

. 
. * Keep the variables we want to use for analysis
. keep developed g_gdp_per_cap `g_tech' `controls' `g_controls' year

. browse

. 
. * Drop years we don't have any data
. drop if year >= 2004
(10 observations deleted)

. foreach var of varlist _all {
  2.         replace `var' = 0 if missing(`var')
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(27 real changes made)
(2 real changes made)
(65 real changes made)
(28 real changes made)
(61 real changes made)
(3 real changes made)
(78 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(38 real changes made)

. 
. cd "../"
C:\Users\jpbeal\Box\Econ 388\econ388_tech_growth

. save cleaned_data.dta, replace
file cleaned_data.dta saved

. 
. cap log close
