-----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\jpbeal\Box\Econ 388\econ388_tech_growth\stata_code\DE3.log
  log type:  text
 opened on:  11 Apr 2025, 22:48:27

. 
. * Set directory to data
. cd "C:\Users\jpbeal\Box\Econ 388\econ388_tech_growth"
C:\Users\jpbeal\Box\Econ 388\econ388_tech_growth

. 
. * Ensure that we have the data
. capture confirm file "cleaned_data.dta"

. if _rc {
.         do "stata_code\data_cleaning.do"
. }

. 
. * Load the cleaned data
. use cleaned_data, clear

. 
. 
. * Create varlists for technology and control variables
. local g_tech g_cellphone g_ag_tractor g_bed_hosp g_vehicle_car g_eft

. local controls avh hc pop pctivliteracy

. local g_controls g_avh g_hc g_pop g_pctivliteracy

. 
. 
. * Run simple regression with all variables
. // Bare model
. reg g_gdp_per_cap `g_tech', robust

Linear regression                               Number of obs     =        108
                                                F(5, 102)         =       1.21
                                                Prob > F          =     0.3082
                                                R-squared         =     0.0329
                                                Root MSE          =     .03382

-------------------------------------------------------------------------------
              |               Robust
g_gdp_per_cap | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
  g_cellphone |   .0014547   .0051463     0.28   0.778    -.0087529    .0116623
 g_ag_tractor |   .0781614   .0703492     1.11   0.269    -.0613759    .2176987
   g_bed_hosp |   -.011939   .0065442    -1.82   0.071    -.0249194    .0010414
g_vehicle_car |   .0063468   .0098918     0.64   0.523    -.0132735     .025967
        g_eft |   .0015189    .007415     0.20   0.838    -.0131888    .0162266
        _cons |   .0213198   .0061328     3.48   0.001     .0091553    .0334843
-------------------------------------------------------------------------------

. test `g_tech'

 ( 1)  g_cellphone = 0
 ( 2)  g_ag_tractor = 0
 ( 3)  g_bed_hosp = 0
 ( 4)  g_vehicle_car = 0
 ( 5)  g_eft = 0

       F(  5,   102) =    1.21
            Prob > F =    0.3082

. 
. // Controlling variables
. reg g_gdp_per_cap `g_tech' `g_controls', robust

Linear regression                               Number of obs     =        108
                                                F(9, 98)          =     541.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6902
                                                Root MSE          =     .01953

---------------------------------------------------------------------------------
                |               Robust
  g_gdp_per_cap | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
    g_cellphone |  -.0045386   .0041268    -1.10   0.274     -.012728    .0036509
   g_ag_tractor |  -.0081737   .0448906    -0.18   0.856    -.0972577    .0809103
     g_bed_hosp |   -.006351   .0040279    -1.58   0.118    -.0143442    .0016423
  g_vehicle_car |   .0038192   .0069191     0.55   0.582    -.0099116      .01755
          g_eft |  -.0021343   .0068562    -0.31   0.756    -.0157401    .0114715
          g_avh |   .4032285   .3867566     1.04   0.300    -.3642774    1.170734
           g_hc |   1.840864   .3425276     5.37   0.000     1.161129    2.520599
          g_pop |  -.1544285   .0280368    -5.51   0.000    -.2100666   -.0987903
g_pctivliteracy |   .0037133   .0068833     0.54   0.591    -.0099465     .017373
          _cons |   .0144178   .0041093     3.51   0.001      .006263    .0225726
---------------------------------------------------------------------------------

. test `g_tech'

 ( 1)  g_cellphone = 0
 ( 2)  g_ag_tractor = 0
 ( 3)  g_bed_hosp = 0
 ( 4)  g_vehicle_car = 0
 ( 5)  g_eft = 0

       F(  5,    98) =    1.01
            Prob > F =    0.4135

. 
. // Controlling for developed
. reg g_gdp_per_cap `g_tech' developed, robust

Linear regression                               Number of obs     =        108
                                                F(6, 101)         =       1.62
                                                Prob > F          =     0.1482
                                                R-squared         =     0.0606
                                                Root MSE          =      .0335

-------------------------------------------------------------------------------
              |               Robust
g_gdp_per_cap | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
  g_cellphone |    .001566   .0053607     0.29   0.771    -.0090682    .0122002
 g_ag_tractor |   .1002816   .0785906     1.28   0.205    -.0556211    .2561842
   g_bed_hosp |  -.0121933   .0069139    -1.76   0.081    -.0259087    .0015221
g_vehicle_car |    .004672   .0121118     0.39   0.700    -.0193545    .0286986
        g_eft |    .000164   .0074796     0.02   0.983    -.0146735    .0150014
    developed |   .0114185   .0072972     1.56   0.121    -.0030572    .0258942
        _cons |   .0149995   .0094813     1.58   0.117    -.0038089    .0338079
-------------------------------------------------------------------------------

. test `g_tech'

 ( 1)  g_cellphone = 0
 ( 2)  g_ag_tractor = 0
 ( 3)  g_bed_hosp = 0
 ( 4)  g_vehicle_car = 0
 ( 5)  g_eft = 0

       F(  5,   101) =    1.57
            Prob > F =    0.1767

. 
. // Controlling for both
. reg g_gdp_per_cap `g_tech' `g_controls' developed, robust

Linear regression                               Number of obs     =        108
                                                F(10, 97)         =     202.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7360
                                                Root MSE          =     .01812

---------------------------------------------------------------------------------
                |               Robust
  g_gdp_per_cap | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
    g_cellphone |  -.0063732   .0035456    -1.80   0.075    -.0134103     .000664
   g_ag_tractor |  -.0011284   .0423549    -0.03   0.979    -.0851912    .0829343
     g_bed_hosp |  -.0077161   .0040932    -1.89   0.062    -.0158399    .0004078
  g_vehicle_car |   -.000206   .0086828    -0.02   0.981    -.0174389    .0170268
          g_eft |  -.0033118   .0058256    -0.57   0.571     -.014874    .0082503
          g_avh |   .8477669   .5915346     1.43   0.155    -.3262656    2.021799
           g_hc |   2.298002    .339592     6.77   0.000     1.624006    2.971998
          g_pop |  -.1145497   .0302311    -3.79   0.000    -.1745502   -.0545493
g_pctivliteracy |   .0015143   .0058336     0.26   0.796    -.0100639    .0130924
      developed |   .0159693   .0048064     3.32   0.001     .0064299    .0255086
          _cons |   .0036353   .0054336     0.67   0.505     -.007149    .0144196
---------------------------------------------------------------------------------

. test `g_tech'

 ( 1)  g_cellphone = 0
 ( 2)  g_ag_tractor = 0
 ( 3)  g_bed_hosp = 0
 ( 4)  g_vehicle_car = 0
 ( 5)  g_eft = 0

       F(  5,    97) =    1.76
            Prob > F =    0.1274

. 
. // Controlling for both and time
. reg g_gdp_per_cap `g_tech' `g_controls' developed year, robust

Linear regression                               Number of obs     =        108
                                                F(11, 96)         =     222.45
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7494
                                                Root MSE          =     .01775

---------------------------------------------------------------------------------
                |               Robust
  g_gdp_per_cap | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
    g_cellphone |  -.0028076   .0024399    -1.15   0.253    -.0076508    .0020357
   g_ag_tractor |  -.0136871   .0435788    -0.31   0.754    -.1001903    .0728161
     g_bed_hosp |    -.00718   .0039264    -1.83   0.071    -.0149739    .0006139
  g_vehicle_car |   .0003928   .0111479     0.04   0.972    -.0217356    .0225211
          g_eft |   .0022904   .0053386     0.43   0.669    -.0083066    .0128874
          g_avh |   .8753923   .5623803     1.56   0.123    -.2409238    1.991708
           g_hc |   2.580399   .3595162     7.18   0.000     1.866765    3.294033
          g_pop |  -.0981856   .0315086    -3.12   0.002    -.1607296   -.0356416
g_pctivliteracy |   .0010465   .0055133     0.19   0.850    -.0098973    .0119903
      developed |    .016112   .0047141     3.42   0.001     .0067546    .0254693
           year |  -.0003018   .0001264    -2.39   0.019    -.0005528   -.0000508
          _cons |   .5971085   .2517203     2.37   0.020     .0974476    1.096769
---------------------------------------------------------------------------------

. test `g_tech'

 ( 1)  g_cellphone = 0
 ( 2)  g_ag_tractor = 0
 ( 3)  g_bed_hosp = 0
 ( 4)  g_vehicle_car = 0
 ( 5)  g_eft = 0

       F(  5,    96) =    1.23
            Prob > F =    0.2997

. 
. gen year2 = year^2

. 
. // Controlling for vars and time by developed
. reg g_gdp_per_cap `g_tech' `g_controls' year if developed==0, robust

Linear regression                               Number of obs     =         54
                                                F(10, 43)         =     424.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8045
                                                Root MSE          =      .0215

---------------------------------------------------------------------------------
                |               Robust
  g_gdp_per_cap | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
    g_cellphone |  -.0025932   .0029545    -0.88   0.385    -.0085515     .003365
   g_ag_tractor |   .0205265   .0673527     0.30   0.762    -.1153032    .1563562
     g_bed_hosp |  -.0047509   .0034975    -1.36   0.181    -.0118044    .0023025
  g_vehicle_car |  -.0039658   .0089847    -0.44   0.661    -.0220852    .0141536
          g_eft |  -.0032416   .0074767    -0.43   0.667    -.0183198    .0118365
          g_avh |  -.2494924   .4918395    -0.51   0.615    -1.241381    .7423966
           g_hc |   1.959477   .5378036     3.64   0.001     .8748924    3.044061
          g_pop |  -.1409222   .0366201    -3.85   0.000    -.2147737   -.0670708
g_pctivliteracy |   .0071776   .0064788     1.11   0.274    -.0058882    .0202434
           year |   2.16e-06   .0002966     0.01   0.994     -.000596    .0006003
          _cons |    .000885   .5859282     0.00   0.999    -1.180752    1.182522
---------------------------------------------------------------------------------

. test `g_tech'

 ( 1)  g_cellphone = 0
 ( 2)  g_ag_tractor = 0
 ( 3)  g_bed_hosp = 0
 ( 4)  g_vehicle_car = 0
 ( 5)  g_eft = 0

       F(  5,    43) =    0.80
            Prob > F =    0.5570

. reg g_gdp_per_cap `g_tech' `g_controls' year if developed==1, robust

Linear regression                               Number of obs     =         54
                                                F(10, 43)         =      29.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7123
                                                Root MSE          =     .01052

---------------------------------------------------------------------------------
                |               Robust
  g_gdp_per_cap | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
    g_cellphone |  -.0011456   .0060339    -0.19   0.850    -.0133141     .011023
   g_ag_tractor |  -.0314243   .0337188    -0.93   0.357    -.0994247    .0365761
     g_bed_hosp |   .2287063   .0926584     2.47   0.018     .0418428    .4155698
  g_vehicle_car |   .0147644   .0111284     1.33   0.192    -.0076781    .0372069
          g_eft |  -.0118334   .0096551    -1.23   0.227    -.0313047     .007638
          g_avh |   2.106774   .3551455     5.93   0.000     1.390555    2.822993
           g_hc |    3.43341   .9276287     3.70   0.001     1.562668    5.304151
          g_pop |   1.783361   .5907806     3.02   0.004     .5919382    2.974783
g_pctivliteracy |  -1.006272   .3144161    -3.20   0.003    -1.640353   -.3721919
           year |  -.0001135   .0000902    -1.26   0.215    -.0002954    .0000684
          _cons |    .222797   .1766342     1.26   0.214    -.1334198    .5790139
---------------------------------------------------------------------------------

. test `g_tech'

 ( 1)  g_cellphone = 0
 ( 2)  g_ag_tractor = 0
 ( 3)  g_bed_hosp = 0
 ( 4)  g_vehicle_car = 0
 ( 5)  g_eft = 0

       F(  5,    43) =    5.42
            Prob > F =    0.0006

. 
. * Modeling interaction effects
. local g_interaction

. foreach var in `g_tech' {
  2.         gen dev_`var' = developed * `var'
  3.         local g_interaction `g_interaction' dev_`var'
  4. }

. 
. * Regression on interaction effects
. reg g_gdp_per_cap `g_tech' `g_controls' `g_interaction', robust

Linear regression                               Number of obs     =        108
                                                F(14, 93)         =     409.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7393
                                                Root MSE          =     .01839

-----------------------------------------------------------------------------------
                  |               Robust
    g_gdp_per_cap | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
      g_cellphone |    -.00692   .0042728    -1.62   0.109    -.0154048    .0015649
     g_ag_tractor |  -.0322222   .0513336    -0.63   0.532    -.1341606    .0697163
       g_bed_hosp |  -.0066158   .0040716    -1.62   0.108    -.0147012    .0014696
    g_vehicle_car |  -.0082493   .0072046    -1.15   0.255    -.0225561    .0060575
            g_eft |  -.0049051   .0089795    -0.55   0.586    -.0227366    .0129265
            g_avh |   .6796161   .4671953     1.45   0.149    -.2481412    1.607373
             g_hc |   2.193247   .3200643     6.85   0.000     1.557662    2.828831
            g_pop |  -.1243621   .0261901    -4.75   0.000    -.1763704   -.0723537
  g_pctivliteracy |   .0032274   .0061701     0.52   0.602    -.0090252      .01548
  dev_g_cellphone |   .0169176   .0071204     2.38   0.020     .0027779    .0310574
 dev_g_ag_tractor |   .0626467   .0635473     0.99   0.327    -.0635455     .188839
   dev_g_bed_hosp |   .2385208   .0972375     2.45   0.016     .0454264    .4316151
dev_g_vehicle_car |   .0966723   .0430009     2.25   0.027     .0112809    .1820636
        dev_g_eft |  -.0181682   .0138215    -1.31   0.192     -.045615    .0092785
            _cons |   .0086806   .0043767     1.98   0.050    -.0000108    .0173719
-----------------------------------------------------------------------------------

. 
. 
. * Rerun regressions and output to latex file
. eststo model1: reg g_gdp_per_cap `g_tech', robust

Linear regression                               Number of obs     =        108
                                                F(5, 102)         =       1.21
                                                Prob > F          =     0.3082
                                                R-squared         =     0.0329
                                                Root MSE          =     .03382

-------------------------------------------------------------------------------
              |               Robust
g_gdp_per_cap | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
  g_cellphone |   .0014547   .0051463     0.28   0.778    -.0087529    .0116623
 g_ag_tractor |   .0781614   .0703492     1.11   0.269    -.0613759    .2176987
   g_bed_hosp |   -.011939   .0065442    -1.82   0.071    -.0249194    .0010414
g_vehicle_car |   .0063468   .0098918     0.64   0.523    -.0132735     .025967
        g_eft |   .0015189    .007415     0.20   0.838    -.0131888    .0162266
        _cons |   .0213198   .0061328     3.48   0.001     .0091553    .0334843
-------------------------------------------------------------------------------

. eststo model2: reg g_gdp_per_cap `g_tech' `g_controls', robust

Linear regression                               Number of obs     =        108
                                                F(9, 98)          =     541.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6902
                                                Root MSE          =     .01953

---------------------------------------------------------------------------------
                |               Robust
  g_gdp_per_cap | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
    g_cellphone |  -.0045386   .0041268    -1.10   0.274     -.012728    .0036509
   g_ag_tractor |  -.0081737   .0448906    -0.18   0.856    -.0972577    .0809103
     g_bed_hosp |   -.006351   .0040279    -1.58   0.118    -.0143442    .0016423
  g_vehicle_car |   .0038192   .0069191     0.55   0.582    -.0099116      .01755
          g_eft |  -.0021343   .0068562    -0.31   0.756    -.0157401    .0114715
          g_avh |   .4032285   .3867566     1.04   0.300    -.3642774    1.170734
           g_hc |   1.840864   .3425276     5.37   0.000     1.161129    2.520599
          g_pop |  -.1544285   .0280368    -5.51   0.000    -.2100666   -.0987903
g_pctivliteracy |   .0037133   .0068833     0.54   0.591    -.0099465     .017373
          _cons |   .0144178   .0041093     3.51   0.001      .006263    .0225726
---------------------------------------------------------------------------------

. eststo model3: reg g_gdp_per_cap `g_tech' `g_controls' developed, robust

Linear regression                               Number of obs     =        108
                                                F(10, 97)         =     202.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7360
                                                Root MSE          =     .01812

---------------------------------------------------------------------------------
                |               Robust
  g_gdp_per_cap | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
    g_cellphone |  -.0063732   .0035456    -1.80   0.075    -.0134103     .000664
   g_ag_tractor |  -.0011284   .0423549    -0.03   0.979    -.0851912    .0829343
     g_bed_hosp |  -.0077161   .0040932    -1.89   0.062    -.0158399    .0004078
  g_vehicle_car |   -.000206   .0086828    -0.02   0.981    -.0174389    .0170268
          g_eft |  -.0033118   .0058256    -0.57   0.571     -.014874    .0082503
          g_avh |   .8477669   .5915346     1.43   0.155    -.3262656    2.021799
           g_hc |   2.298002    .339592     6.77   0.000     1.624006    2.971998
          g_pop |  -.1145497   .0302311    -3.79   0.000    -.1745502   -.0545493
g_pctivliteracy |   .0015143   .0058336     0.26   0.796    -.0100639    .0130924
      developed |   .0159693   .0048064     3.32   0.001     .0064299    .0255086
          _cons |   .0036353   .0054336     0.67   0.505     -.007149    .0144196
---------------------------------------------------------------------------------

. eststo model4: reg g_gdp_per_cap `g_tech' `g_controls' developed year, robust

Linear regression                               Number of obs     =        108
                                                F(11, 96)         =     222.45
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7494
                                                Root MSE          =     .01775

---------------------------------------------------------------------------------
                |               Robust
  g_gdp_per_cap | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
    g_cellphone |  -.0028076   .0024399    -1.15   0.253    -.0076508    .0020357
   g_ag_tractor |  -.0136871   .0435788    -0.31   0.754    -.1001903    .0728161
     g_bed_hosp |    -.00718   .0039264    -1.83   0.071    -.0149739    .0006139
  g_vehicle_car |   .0003928   .0111479     0.04   0.972    -.0217356    .0225211
          g_eft |   .0022904   .0053386     0.43   0.669    -.0083066    .0128874
          g_avh |   .8753923   .5623803     1.56   0.123    -.2409238    1.991708
           g_hc |   2.580399   .3595162     7.18   0.000     1.866765    3.294033
          g_pop |  -.0981856   .0315086    -3.12   0.002    -.1607296   -.0356416
g_pctivliteracy |   .0010465   .0055133     0.19   0.850    -.0098973    .0119903
      developed |    .016112   .0047141     3.42   0.001     .0067546    .0254693
           year |  -.0003018   .0001264    -2.39   0.019    -.0005528   -.0000508
          _cons |   .5971085   .2517203     2.37   0.020     .0974476    1.096769
---------------------------------------------------------------------------------

. 
. esttab model1 model2 model3 model4 using normal_reg.tex, replace ///
>     se star(* 0.10 ** 0.05 *** 0.01) ///
>     label title("Effect of Technology Growth on GDP per Capita Growth") ///
>     alignment(D{.}{.}{-1}) ///
>     compress
(file normal_reg.tex not found)
(output written to normal_reg.tex)

. 
. eststo model5: reg g_gdp_per_cap `g_tech' `g_controls' year if developed==0, robust

Linear regression                               Number of obs     =         54
                                                F(10, 43)         =     424.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8045
                                                Root MSE          =      .0215

---------------------------------------------------------------------------------
                |               Robust
  g_gdp_per_cap | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
    g_cellphone |  -.0025932   .0029545    -0.88   0.385    -.0085515     .003365
   g_ag_tractor |   .0205265   .0673527     0.30   0.762    -.1153032    .1563562
     g_bed_hosp |  -.0047509   .0034975    -1.36   0.181    -.0118044    .0023025
  g_vehicle_car |  -.0039658   .0089847    -0.44   0.661    -.0220852    .0141536
          g_eft |  -.0032416   .0074767    -0.43   0.667    -.0183198    .0118365
          g_avh |  -.2494924   .4918395    -0.51   0.615    -1.241381    .7423966
           g_hc |   1.959477   .5378036     3.64   0.001     .8748924    3.044061
          g_pop |  -.1409222   .0366201    -3.85   0.000    -.2147737   -.0670708
g_pctivliteracy |   .0071776   .0064788     1.11   0.274    -.0058882    .0202434
           year |   2.16e-06   .0002966     0.01   0.994     -.000596    .0006003
          _cons |    .000885   .5859282     0.00   0.999    -1.180752    1.182522
---------------------------------------------------------------------------------

. eststo model6: reg g_gdp_per_cap `g_tech' `g_controls' year if developed==1, robust

Linear regression                               Number of obs     =         54
                                                F(10, 43)         =      29.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7123
                                                Root MSE          =     .01052

---------------------------------------------------------------------------------
                |               Robust
  g_gdp_per_cap | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
    g_cellphone |  -.0011456   .0060339    -0.19   0.850    -.0133141     .011023
   g_ag_tractor |  -.0314243   .0337188    -0.93   0.357    -.0994247    .0365761
     g_bed_hosp |   .2287063   .0926584     2.47   0.018     .0418428    .4155698
  g_vehicle_car |   .0147644   .0111284     1.33   0.192    -.0076781    .0372069
          g_eft |  -.0118334   .0096551    -1.23   0.227    -.0313047     .007638
          g_avh |   2.106774   .3551455     5.93   0.000     1.390555    2.822993
           g_hc |    3.43341   .9276287     3.70   0.001     1.562668    5.304151
          g_pop |   1.783361   .5907806     3.02   0.004     .5919382    2.974783
g_pctivliteracy |  -1.006272   .3144161    -3.20   0.003    -1.640353   -.3721919
           year |  -.0001135   .0000902    -1.26   0.215    -.0002954    .0000684
          _cons |    .222797   .1766342     1.26   0.214    -.1334198    .5790139
---------------------------------------------------------------------------------

. eststo model7: reg g_gdp_per_cap `g_tech' `g_controls' developed `g_interaction' year, 
> robust

Linear regression                               Number of obs     =        108
                                                F(16, 91)         =     156.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7568
                                                Root MSE          =     .01795

-----------------------------------------------------------------------------------
                  |               Robust
    g_gdp_per_cap | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
      g_cellphone |  -.0036844   .0028815    -1.28   0.204     -.009408    .0020393
     g_ag_tractor |  -.0161237   .0628487    -0.26   0.798    -.1409649    .1087174
       g_bed_hosp |  -.0071141   .0040043    -1.78   0.079    -.0150682      .00084
    g_vehicle_car |  -.0045546   .0107351    -0.42   0.672    -.0258786    .0167695
            g_eft |  -.0004262   .0077109    -0.06   0.956    -.0157429    .0148905
            g_avh |   .8249614   .5561384     1.48   0.141    -.2797391    1.929662
             g_hc |   2.556086   .4093628     6.24   0.000     1.742937    3.369235
            g_pop |   -.099461   .0333867    -2.98   0.004    -.1657797   -.0331424
  g_pctivliteracy |    .001445    .005646     0.26   0.799    -.0097701    .0126601
        developed |   .0112267   .0074468     1.51   0.135    -.0035656    .0260189
  dev_g_cellphone |   .0104321    .009071     1.15   0.253    -.0075863    .0284505
 dev_g_ag_tractor |   .0002894   .0690576     0.00   0.997     -.136885    .1374638
   dev_g_bed_hosp |   .1995778   .1017567     1.96   0.053    -.0025493    .4017049
dev_g_vehicle_car |   .0500673   .0324174     1.54   0.126    -.0143258    .1144604
        dev_g_eft |  -.0121026   .0145394    -0.83   0.407    -.0409833    .0167781
             year |  -.0002604   .0001641    -1.59   0.116    -.0005864    .0000656
            _cons |   .5162744   .3255413     1.59   0.116    -.1303735    1.162922
-----------------------------------------------------------------------------------

. 
. esttab model5 model6 model7 using by_developed.tex, replace ///
>         se star(* 0.10 ** 0.05 *** 0.01) ///
>         label title("Effect of Technology Growth on GDP per Capita Growth by Developed"
> ) ///
>     alignment(D{.}{.}{-1}) ///
>     compress
(file by_developed.tex not found)
(output written to by_developed.tex)

.         
. save cleaned_data.dta, replace
file cleaned_data.dta saved

. 
. cap log close
